load-tests/api-gateway/stress-summary.txt
     ✓ health check status is 200

     checks.........................: 100.00% ✓ 294286     ✗ 0     
     data_received..................: 275 MB  654 kB/s
     data_sent......................: 25 MB   60 kB/s
   ✓ errors.........................: 0.00%   ✓ 0          ✗ 0     
     http_req_blocked...............: avg=15.3µs   min=0s       med=0s       max=32.51ms  p(90)=0s    p(95)=0s      
     http_req_connecting............: avg=7.3µs    min=0s       med=0s       max=31ms     p(90)=0s    p(95)=0s      
     http_req_duration..............: avg=622.62ms min=1.08ms   med=557.58ms max=4.76s    p(90)=1.22s p(95)=1.45s   
     ✗ { expected_response:true }...: avg=622.62ms min=1.08ms   med=557.58ms max=4.76s    p(90)=1.22s p(95)=1.45s   
   ✓ http_req_failed................: 0.00%   ✓ 0          ✗ 294286
     http_req_receiving.............: avg=70.64µs  min=0s       med=0s       max=167.63ms p(90)=0s    p(95)=530.69µs
     http_req_sending...............: avg=28.71µs  min=0s       med=0s       max=43.33ms  p(90)=0s    p(95)=0s      
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s    p(95)=0s      
     http_req_waiting...............: avg=622.52ms min=1.07ms   med=557.47ms max=4.76s    p(90)=1.22s p(95)=1.45s   
     http_reqs......................: 294286  700.638626/s
     iteration_duration.............: avg=724.97ms min=101.41ms med=659.93ms max=4.86s    p(90)=1.32s p(95)=1.55s   
     iterations.....................: 294286  700.638626/s
     vus............................: 10      min=1        max=1000
     vus_max........................: 1000    min=1000     max=1000